from flask import Flask
from data import db_session
from data.regions import Regions


app = Flask(__name__)
app.config['SECRET_KEY'] = 'yandexlyceum_secret_key'


def main():
    db_session.global_init("db/narod.db")
    #app.run()


reg = Regions()
reg.region = "Мурманская область"
reg.narods = ("Мурманская область населена представителями различных народов. "
              "Здесь проживают русские, ненцы, саамы, карелы и другие этнические группы."
              " Каждый из этих народов привнес свою культуру, язык и традиции в жизнь региона. "
              "Например, саамская культура с её уникальными обрядами и ремеслами, а также ненецкие "
              "традиции, связанные с оленеводством, играют важную роль в культурном ландшафте области.")
reg.mine = ("Экономика Мурманской области в значительной степени зависит от природных ресурсов. "
            "Рыболовство и рыбопереработка являются основными отраслями, так как регион расположен на побережье "
            "Баренцева моря, богатого рыбой. В последние годы активно развиваются также добыча "
            "полезных ископаемых, таких как никель, медь и другие металлы, а также горнодобывающая промышленность. ")
reg.development = ("Мурманская область имеет долгую и сложную историю освоения. Первые русские поселения появились "
                   "здесь в XVI-XVII веках, но более активное освоение началось в XIX веке. В это время был основан "
                   "город Мурманск, который стал важным портом и центром рыболовства.")
reg.history = ("Во время Второй мировой войны регион играл стратегическую роль, и здесь проходили важные военные"
               " операции. После войны началось активное развитие промышленности и инфраструктуры, что способствовало"
               " росту населения и экономическому процветанию.")
reg.now_time = ("Сегодня Мурманская область — это динамично развивающийся регион с разнообразной экономикой. "
                "Город Мурманск является административным центром и важным транспортным узлом. Область активно"
                " участвует в реализации различных федеральных программ, направленных на развитие инфраструктуры,"
                " экологии и социальной сферы. Сейчас в регионе также уделяется внимание экотуризму, который "
                "привлекает туристов своими уникальными природными ландшафтами, северным сиянием и возможностью "
                "наблюдать за дикой природой.")
reg.traditions = ("Соление рыбы — традиционный способ её хранения и приготовления. В Мурманской области часто солят "
                  "сельдь, треску и другие виды рыбы. Солёная рыба подаётся как закуска, "
                  "часто с картофелем и свежими овощами.")
reg.future_time = ("Перспективы Мурманской области связаны с дальнейшим развитием экономики, "
                   "основанной на высоких технологиях и устойчивом использовании природных ресурсов. "
                   "Ожидается увеличение инвестиций в рыбную промышленность, горнодобывающую отрасль"
                   " и экотуризм. Кроме того, развитие инфраструктуры, включая транспортные пути и связь, "
                   "может способствовать улучшению качества жизни местных жителей и привлечению новых инвесторов. "
                   "Устойчивое развитие и внимание к экологии также станут важными аспектами в будущем, что "
                   "позволит сохранить уникальную природу региона для будущих поколений.")
if __name__ == '__main__':
    main()
    db_sess = db_session.create_session()
    db_sess.add(reg)
    db_sess.commit()
    reg = db_sess.query(Regions).first()
    print(reg.region, reg.narods)